# Запросы корректировки, соединение таблиц

In [ ]:
%load_ext sql
%sql mysql://root:adminadmin@localhost:3306/stepik?charset=utf8

In [ ]:
%%sql
--
SELECT
    version();

In [ ]:
%%sql 
--

DROP TABLE IF EXISTS book_23 CASCADE;
DROP TABLE IF EXISTS author_23 CASCADE;
DROP TABLE IF EXISTS supply_23;
DROP TABLE IF EXISTS genre_23 CASCADE;


CREATE TABLE IF NOT EXISTS author_23
(
	author_id   int PRIMARY KEY AUTO_INCREMENT,
	name_author text
);

INSERT INTO author_23(name_author)
VALUES ('Булгаков М.А.'),
       ('Достоевский Ф.М.'),
       ('Есенин С.А.'),
       ('Пастернак Б.Л.'),
       ('Лермонтов М.Ю.');

CREATE TABLE IF NOT EXISTS genre_23
(
	genre_id   INT PRIMARY KEY AUTO_INCREMENT,
	name_genre TEXT
);

INSERT INTO genre_23(name_genre)
VALUES ('Роман'),
       ('Поэзия'),
       ('Приключения');

CREATE TABLE IF NOT EXISTS book_23
(
	book_id   INT PRIMARY KEY AUTO_INCREMENT,
	title     TEXT,
	author_id INT NOT NULL,
	genre_id  INT,
	price     DECIMAL(8, 2),
	amount    INT,
	FOREIGN KEY (author_id) REFERENCES author_23 (author_id) ON DELETE CASCADE,
	FOREIGN KEY (genre_id) REFERENCES genre_23 (genre_id) ON DELETE SET NULL
);

INSERT INTO book_23(title, author_id, genre_id, price, amount)
VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3),
       ('Белая гвардия', 1, 1, 540.50, 5),
       ('Идиот', 2, 1, 460.00, 10),
       ('Братья Карамазовы', 2, 1, 799.01, 3),
       ('Игрок', 2, 1, 480.50, 10),
       ('Стихотворения и поэмы', 3, 2, 650.00, 15),
       ('Черный человек', 3, 2, 570.20, 6),
       ('Лирика', 4, 2, 518.99, 2);

CREATE TABLE IF NOT EXISTS supply_23
(
	supply_id INT PRIMARY KEY AUTO_INCREMENT,
	title     TEXT,
	author    TEXT,
	price     DECIMAL(8, 2),
	amount    INT
);

INSERT INTO supply_23(title, author, price, amount)
VALUES ('Доктор Живаго', 'Пастернак Б.Л.', 380.80, 4),
       ('Черный человек', 'Есенин С.А.', 570.20, 6),
       ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
       ('Идиот', 'Достоевский Ф.М.', 360.80, 3),
       ('Стихотворения и поэмы', 'Лермонтов М.Ю.', 255.90, 4),
       ('Остров сокровищ', 'Стивенсон Р.Л.', 599.99, 5);

In [ ]:
%%sql 
--
-- Для книг, которые уже есть на складе (в таблице book),
--  но по другой цене, чем в поставке (supply),
--   необходимо в таблице book увеличить количество на значение, указанное в поставке,  
-- и пересчитать цену. 
-- А в таблице  supply обнулить количество этих книг.
--  Формула для пересчета цены:
-- price = (p1*k1 + p2*k1) / (k1 + k2)
-- где  p1, p2 - цена книги в таблицах book и supply;
-- k1, k2 - количество книг в таблицах book и supply.
UPDATE
       book_23 as b
       INNER JOIN author_23 as a USING(author_id)
       INNER JOIN supply_23 as s ON b.title = s.title
       AND s.author = a.name_author
SET

       b.price = ((b.price * b.amount) + (s.price * s.amount))/ (b.amount + s.amount),
       b.amount = b.amount + s.amount,
       s.amount = 0
WHERE b.price <> s.price;

In [ ]:
%%sql
SELECT * FROM book_23;

In [ ]:
%%sql
SELECT * FROM supply_23;

In [ ]:
%%sql 
--
-- Включить новых авторов в таблицу author с помощью запроса на добавление, 
-- а затем вывести все данные из таблицы author.  
-- Новыми считаются авторы, которые есть в таблице supply, но нет в таблице author.

INSERT INTO
    author_23(name_author)
SELECT
    DISTINCT s.author
FROM
    author_23 AS a
    RIGHT JOIN supply_23 as s ON a.name_author = s.author
WHERE
    a.name_author IS NULL;

SELECT
    *
FROM
    author_23

In [ ]:
%%sql
INSERT INTO book_23(title, author_id, price, amount)
SELECT
    title,
    author_id,
    price,
    amount
FROM
    author_23 AS a
    INNER JOIN supply_23 as s ON a.name_author = s.author
WHERE
    amount <> 0;
SELECT * FROM supply_23

In [ ]:
%%sql
SELECT * FROM book_23;

In [ ]:
%%sql 
--  Занести для книги «Стихотворения и поэмы» Лермонтова жанр «Поэзия», 
-- а для книги «Остров сокровищ» Стивенсона - «Приключения». (Использовать два запроса).
UPDATE
    book_23
    INNER JOIN author_23 USING(author_id)
SET
    genre_id = (
        SELECT
            genre_id
        FROM
            genre_23
        WHERE
            name_genre = 'Поэзия'
    )
WHERE
    (title, name_author) = ('Стихотворения и поэмы', 'Лермонтов М.Ю.');
UPDATE
    book_23
    INNER JOIN author_23 USING(author_id)
SET
    genre_id = (
        SELECT
            genre_id
        FROM
            genre_23
        WHERE
            name_genre = 'Приключения'
    )
WHERE
    (title, name_author) = ('Остров сокровищ', 'Стивенсон Р.Л.');
    
SELECT * FROM book_23;

In [ ]:
%%sql 
-- Удалить всех авторов и все их книги, общее количество книг которых меньше 20.
DELETE FROM
    author_23
WHERE
    author_id IN (
        SELECT
            author_id
        FROM
            book_23
        GROUP BY
            author_id
        HAVING
            count(amount) < 20
    );
SELECT * FROM author_23

In [ ]:
%%sql
-- Удалить все жанры, к которым относится меньше 4-х книг. 
-- В таблице book для этих жанров установить значение Null.
DELETE FROM
    genre_23
WHERE
    genre_id IN (
        SELECT
            genre_id
        FROM
            book_23
        GROUP BY
            genre_id
        HAVING
            COUNT(title) < 4
    );
SELECT * FROM genre_23

In [ ]:
%%sql
-- Удалить всех авторов, которые пишут в жанре "Поэзия".
--  Из таблицы book удалить все книги этих авторов.
--  В запросе для отбора авторов использовать полное название жанра, а не его id.
DELETE FROM
    a
    USING author_23 AS a
    INNER JOIN book_23 AS b USING(author_id)
    INNER JOIN genre_23 AS g USING(genre_id)
WHERE
    g.name_genre = 'Поэзия';